; -------------------------------------------------------------------------------------------------
;
; 7z SFX Builder Language File
;
; Translation Instructions:
;	File extension must be '.ini' in order to make 7z SFX Builder load language file.
;	DON'T remove SECTION NAMES! (ex: [LangOptions], [Global] ...)
;	Update your and language information in 'LangOptions' section
;	Save the file in Unicode format
;	E-mail new language files to mirza.b.1695@gmail.com for inclusion in main installer.
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function.
;	\n - indicates a newline character, which will be replaced when displayed.
;	\~n - indicates double newline character.
;	\s - indicates a special strings (generally file names)
;		The order and number of \s variables is very important and should not be modified.
;	\~s - same as \s. only quotes are added.
;
; -------------------------------------------------------------------------------------------------

[LangOptions]
LANG_NAME="Chinese, zh-tw"
LANG_NATIVE_NAME="中文, 臺灣"
VERSION=2.0.7
NAME=John H.
CONTACT=mailto:johnmhsieh@gmail.com

[Global]
TIP_ADD="新增"
TIP_EDIT="編輯"
TIP_DELETE="刪除"
TIP_DELETE_ALL="刪除全部"
TIP_MOVE_UP="往上移動"
TIP_MOVE_DOWN="往下移動"
BTN_SAVE="儲存"
BTN_CANCEL="取消"
CHK_QUOTES="使用雙引號"
LST_SEC_QUOTES="雙引號"
ERROR_MSG_TITLE="發生錯誤"
WARNING_MSG_TITLE="警告"
INFORMATION_MSG_TITLE="資訊"
QUESTION_MSG_TITLE="問題"
BTN_OK="確定"
TEST="測試"
TIP_BROWSE="瀏覽"
TIP_OPEN="開啟檔案位置"

[Menu]
MENU_FILE="&檔案"
MENU_SETTINGS="&設定"
MENU_HELP="&幫助"
MI_OPEN="&Open file..."
MI_RELOAD="R&eopen"
MI_SAVE="&Save"
MI_SAVE_AS="Save &as..."
MI_CLOSE="&Close"
SUB_MENU_RECENT_FILES="&Recent files"
MI_CLEAR_LIST="C&lear list"
MI_EXIT="E&xit"
MI_OPTIONS="&Options"
SUB_MENU_LANG="&Language"
MI_HELP="Hel&p"
MI_SITE="Project &site"
MI_ABOUT="A&bout"
MI_PRESET_MANAGER="Preset Manager"

[ToolbarTips]
OPEN="開啟舊檔"
SAVE="儲存"
SAVE_AS="另存新檔"
CLOSE="關閉檔案"
TEST="測試"
PRESET="設定檔管理員"
MAKE_SFX="輸出自解壓縮檔"
OPTIONS="選項"

[TabNames]
MAIN="主選單"
TITLE_TEXT="標題/文字內容"
DIALOGS="對話框"
RUN="執行"
DELETE="刪除"
SHORTCUTS="捷徑"
SET_ENV="環境設定"
OUTPUT="輸出"
SFX="自解壓縮檔"

[Tab_Main]
CHK_TEMP_MODE="暫存模式"
CHK_SKIP_LOCKED="略過系統已鎖定的檔案"
CHK_DELETE_SFX="解壓縮後刪除自解壓縮檔"
CHK_BPT="BeginPrompt 時間設定 (負值：否或取消)"
CHK_XDWIDTH="ExtractDialog 對話框的寬度"
CHK_XPWIDTH="ExtractPath 對話框的寬度"
RAD_OW_MODE_1="覆寫所有檔案"
RAD_OW_MODE_2="不要覆寫檔案"
RAD_OW_MODE_3="僅覆寫舊檔案"
RAD_GUI_MODE_1="顯示所有的圖形介面"
RAD_GUI_MODE_2="解壓時不顯示取消鍵"
RAD_GUI_MODE_3="隱藏所有的視窗介面"
GRP_OW_MODE="覆寫模式"
GRP_GUI_MODE="圖形介面模式"
LBL_EXT_PATH="解壓路徑"
MI_SFX_NAME="自解壓縮檔檔名"
MI_SFX_PATH="自解壓縮檔路徑"
TIP_EDIT="編輯選項"
TIP_INSERT="加入變數"
TIP_RELOAD="重新載入"
TIP_OPEN="以預設文字編輯器來開啟"

[Tab_TitleText]
GRP_TITLE="視窗標題"
GRP_TEXT="文字內容"
LBL_WIN_TITLE="起始視窗"
LBL_EXT_PATH_WIN_TITLE="解壓路徑確認視窗"
LBL_EXT_WIN_TITLE="解壓進度視窗"
LBL_ERROR_WIN_TITLE="錯誤訊息視窗"
LBL_WARN_WIN_TITLE="警告訊息視窗"
LBL_PASSWD_TITLE="密碼輸入視窗"
LBL_PASSWD_TEXT="密碼輸入視窗"
LBL_EXT_CANCEL_TEXT="取消解壓縮視窗"

[Tab_RunProgram]
LST_SEC_PARAMETER="參數"
LST_SEC_PREFIX="前置變數"
LST_SEC_FILE_FOLDER="檔案路徑"
LST_SEC_COMMANDS="指令"

[Tab_Delete]
LST_SEC_PARAMETER="參數"
LST_SEC_FILE_FOLDER="檔案/資料夾路徑"

[Tab_Shortcuts]
LST_SEC_PARAMETER="參數"
LST_SEC_PATH="路徑"
LST_SEC_SRC="來源"
LST_SEC_CMDS="指令"
LST_SEC_NAME="名稱"
LST_SEC_DESC="描述"
LST_SEC_DEST="目的"
LST_SEC_WD="工作目錄"
LST_SEC_ICON="圖示"
LST_SEC_INDEX="索引"

[Tab_SetEnvironment]
LST_SEC_NAME="變數名稱"
LST_SEC_VALUE="變數數值"

[Tab_SFX]
BTN_SELECT="選擇…"
BTN_MAKE_SFX="輸出自解壓縮檔"
BTN_SFX_OPTIONS="壓縮選項"
BTN_EDIT_VERS="編輯版本"
CHK_INCLUDE_PATH="把以下路徑立即寫入到設定檔內"
CHK_USE_SELECTED_CFG="使用以下設定檔"
GRP_SFX_FILES="自解壓縮檔"
GRP_SFX_ICON="圖示"
LBL_CONFIG_FILE="檔案路徑 - 設定檔"
LBL_7Z_ARCHIVE="來源檔案 - 7z 壓縮檔"
LBL_SFX_MODULE="使用模組 - 自解壓縮檔"
LBL_SFX_PATH="存檔路徑 - 自解壓縮檔"
LBL_SFX_ICON="圖示路徑 - 自解壓縮檔"

[GUI_ProgramOptions]
GUI_TITLE="選項"
BTN_INTEGRATE="將程式整合到系統選單"
BTN_EXPORT="匯出設定檔…"
MI_REGISTRY="存成登錄檔(.reg)"
MI_INI="存成設定檔(.ini)"
CHK_USERMODE="將設定存在登錄檔內"
CHK_AUTODEFMOD="自動使用預設模組 (假如未指定自解壓縮檔模組)"
CHK_IGNORE_EMPTY="填入資料到屬性欄位 (詳細資料)"
CHK_AUTO_NAME_SFX="將自解壓縮檔存在壓縮檔的目錄內 (假如未指定自解壓縮檔輸出目錄)"
CHK_OVERWRITE_FILES="覆寫已存在的自解壓縮檔 (不會要求使用者進行確認)"
GRP_PROGRAM="程式"
GRP_SFX="自解壓縮檔"
LBL_LANGUAGE="語言設定"

[GUI_PresetManager]
GUI_TITLE="設定檔管理員"
GUI_TITLE2="新增設定檔"
GUI_TITLE3="更名設定檔"
BTN_NEW="新增"
BTN_LOAD="載入"
BTN_SAVE="儲存"
BTN_EDIT="編輯名稱"
BTN_DELETE="刪除"
LBL_NAME="輸入設定檔名稱"

[GUI_ArchiveSets]
CHK_SUBFILES="只有在給定的資料夾來壓縮檔案與資料夾"
LBL_DRAGDROP="你可以使用滑鼠拖曳來新增檔案與資料夾"
TIP_ADDFILE="新增檔案"
TIP_ADDFOLDER="新增資料夾"

[GUI_SFXOpts]
GUI_TITLE="自解壓縮檔選項"
TAB_SFX_OPTIONS="自解壓縮檔選項"
TAB_ARCHIVE_FILES="壓縮檔"
CHK_USE_UPX="使用 UPX 模組"
CHK_USE_SFX_MOD="使用以下模組"
CMB_USE_7ZIP1="總是使用 7-Zip"
CMB_USE_7ZIP2="僅使用 7-Zip (假如有指定壓縮檔)"
CMB_USE_7ZIP3="不要使用 7-Zip (假如有指定壓縮檔)"
CMB_USE_7ZIP4="不要使用 7-Zip"
LBL_PATH="7-Zip 安裝路徑"
TIP_BROWSE="選擇 7-Zip 安裝路徑"
TIP_CONFIG="7-Zip 壓縮設定"
7ZIP_TITLE="7-Zip 壓縮設定"
7ZIP_LEVEL="壓縮層級"
7ZIP_METHOD="壓縮方法"
7ZIP_DICT="字典大小"
7ZIP_SOLID="結實區塊大小"

[GUI_VersionInfo]
GUI_TITLE="自解壓縮檔詳細資料"
BTN_LOAD="載入"
MI_LOAD_SFXMOD="從已選擇的模組取得"
MI_LOAD_FILE="從程式檔取得"
MI_LOAD_VALUES="從登錄檔載入上次儲存的詳細資料"
MI_SAVE_VALUES="儲存目前的詳細資料到登錄檔"
CHK_INCLUDE="把詳細資料加入到設定檔內"
CHK_CHANGE_VERS="變更詳細資料"

[GUI_Gui.MiscFlags]
GUI_TITLE="編輯旗標 - 圖形介面/其他項目"
BTN_NEW="新增"
BTN_LOAD="載入"
BTN_RESET="重設"
BTN_DELETE="刪除"
LBL_GUI_FLAG_1="(視窗) 將解壓進度百分比數值置於標題的右方 (預設在左方)"
LBL_GUI_FLAG_2="(視窗) 標題不顯示解壓進度百分比數值"
LBL_GUI_FLAG_4="(進度) 將解壓進度百分比數值置於進度條的下方"
LBL_GUI_FLAG_8="(視窗) 使用 XP 樣式 (scheme)"
LBL_GUI_FLAG_16="(字型) 使用粗體字顯示解壓百分比"
LBL_GUI_FLAG_32="(圖示) 顯示圖示在解壓進度視窗"
LBL_GUI_FLAG_64="(視窗) 使用視窗的 BeginPrompt 來指定解壓路徑"
LBL_GUI_FLAG_128="(視窗) 跳出新的視窗來指定解壓路徑"
LBL_GUI_FLAG_256="(視窗) 確認安裝與解壓的終止動作"
LBL_GUI_FLAG_512="(圖示) 不顯示圖示在所有的視窗標題/Alt+Tab"
LBL_GUI_FLAG_1024="(圖示) 顯示圖示在指定解壓路徑視窗"
LBL_GUI_FLAG_2048="(圖示) 顯示圖示在 BeginPrompt 視窗"
LBL_GUI_FLAG_4096="(按鈕) 將 Yes/No 換成 OK/Cancel"
LBL_GUI_FLAG_8192="(進度) 不要在工作管理員顯示解壓進度條 (Windows 7 與以後的系統版本)"
LBL_GUI_FLAG_16384="(文字) 在文字內容顯示 && 符號"
LBL_MISC_FLAG_1="(驗證) 解壓時不檢查所需的磁碟空間"
LBL_MISC_FLAG_2="(驗證) 解壓時不檢查所需的記憶體空間"
LBL_MISC_FLAG_4="(管理) 需要管理員權限來執行所有的工作"
LBL_MISC_FLAG_8="(密碼) 在 BeginPrompt/ExtractPath 視窗之後，顯示密碼輸入視窗"

[GUI_RunProgram]
GUI_TITLE="新增執行檔 - 解壓後進行任何動作"
GUI_PFX_TITLE="編輯前置變數"
LBL_PARAMETER="參數"
LBL_FILE="檔案"
LBL_PREFIX="前置變數"
LBL_COMMANDS="指令"

[GUI_Delete]
GUI_TITLE="新增檔案 - 解壓後進行刪除動作"
LBL_PARAMETER="參數"
LBL_FILE="檔案與資料夾"

[GUI_Shortcuts]
GUI_TITLE="新增捷徑 - 解壓後建立捷徑"
RAD_DESKTOP="桌面"
RAD_START_MENU="開始功能表"
RAD_PROGRAMS="開始功能表\所有程式"
RAD_STARTUP="開始功能表\所有程式\啟動"
RAD_CURRENT_USER="目前使用者"
RAD_ALLUSERS="所有的使用者"
GRP_CREATION_PATH="捷徑位置"
GRP_CREATE_FOR="使用者"
GRP_PARAMETER="參數"
LBL_SOURCE_FILE="來源檔案"
LBL_ARGUMENTS="指令參數"
LBL_NAME="捷徑名稱"
LBL_DESCRIPTION="捷徑描述"
LBL_DEST_FOLDER="目的資料夾"
LBL_WORKING_DIR="工作資料夾"
LBL_ICON_FILE="圖示檔"
LBL_ICON_INDEX="圖示索引"

[GUI_SetEnvironment]
GUI_TITLE="建立環境變數"
LBL_NAME="名稱"
LBL_VALUE="數值"

[GUI_MakeSFX]
GUI_TITLE="建立自解壓縮檔"
BTN_OPEN="瀏覽"
BTN_RUN="執行自解壓縮檔"
BTN_CLOSE="關閉視窗"
REPORT_PREP="準備進行處理…"
REPORT_ARCHIVE1="建立壓縮檔…"
REPORT_ARCHIVE2="7-Zip 不存在"
REPORT_ARCHIVE3="檔案不存在 \~s"
REPORT_ARCHIVE4="壓縮檔建立成功"
REPORT_ARCHIVE5="無法建立壓縮檔"
REPORT_ERROR1="找不到設定檔 \~s"
REPORT_ERROR2="以下檔案不是標準的 7z 自解壓縮檔的設定檔 \~s"
REPORT_ERROR3="建立自解壓縮檔時發生錯誤"
REPORT_ICON1="變更自解壓縮檔圖示"
REPORT_ICON2="自解壓縮檔圖示已成功變更"
REPORT_ICON3="無法變更自解壓縮檔圖示"
REPORT_VERSINFO1="更新版本資訊…"
REPORT_VERSINFO2="版本資訊已成功更新"
REPORT_VERSINFO3="無法更新版本資訊"
REPORT_UPX1="正在使用 UPX 進行壓縮…"
REPORT_UPX2="已成功完成壓縮工作"
REPORT_UPX3="找不到 "upx.exe""
REPORT_BUILD1="正在建立自解壓縮檔…"
REPORT_BUILD2="自解壓縮檔建立失敗"
REPORT_FINISH="成功建立自解壓縮檔 \~s"

[MessageBoxes]
; File open/save operations
MSGBOX1_1="無法找到語言檔"
MSGBOX1_2="指定的檔案不存在"
MSGBOX1_3="檔案未載入，或是不存在"
MSGBOX1_4="指定的設定檔不存在"
MSGBOX1_5="你要開啟這個檔案嗎？ \~n\~s - ?"
MSGBOX1_6="\~s\n不是標準的 7z 自解壓縮檔設定檔\~n你要強迫載入這個設定檔嗎？"
MSGBOX1_7="檔案大小超出正常的設定檔大小\n你要強迫載入這個檔案嗎？"
MSGBOX1_8="目前正在進行的工作有遺失所需的檔案\n\s"
MSGBOX1_9="這個檔案未包含設定檔，無法繼續處理"
MSGBOX1_10="你確定要重新載入檔案嗎？"
MSGBOX1_11="目前的設定未儲存，你要儲存它嗎？"
MSGBOX1_12="無法讀取或是寫入檔案，請確定你有使管理員權限"
; SFX creation
MSGBOX2_1="自解壓縮檔不在這個路徑"
MSGBOX2_2="自解壓縮檔模組未指定"
MSGBOX2_3="指定的自解壓縮檔模組不存在，或是不支援這個格式"
MSGBOX2_4="多個壓縮檔未指定"
MSGBOX2_5="壓縮檔未指定"
MSGBOX2_6="指定的壓縮檔不存在，或是不支援的格式"
MSGBOX2_7="你要覆寫已存在的檔案嗎？ \~n\~s - ?"
MSGBOX2_8="7-Zip 不存在"
MSGBOX2_9="你要使用以下壓縮檔嗎？ \~n\~s - ?\~n假如你要從設定檔的檔案定義建立新的壓縮檔，點選 No"
; Other operations
MSGBOX3_1="程式已成功整合到系統選單內"
MSGBOX3_2="按下 OK 關閉視窗來進行測試"
MSGBOX3_3="你要覆寫已存在的數值嗎？"
MSGBOX3_4="至少要選擇一個選項"
MSGBOX3_5="只能選擇一個選項"
MSGBOX3_6="你確定要刪除已選擇的項目嗎？"
MSGBOX3_7="你確定要刪除所有的項目嗎？"
MSGBOX3_8="已指定的資料是無效的，或是空的"
MSGBOX3_9="檔案未指定"
